list = ["Январь","Февраль","Март","Апрель","Май","Июнь","Июль","Август","Сентябрь","Октябрь","Ноябрь","Декабрь"]
m1, m2, m3, m4, m5, m6, m7, m8, m9, m10, m11, m12 = list
try:
    n = int(input("Введите номер месяца от 1 до 12: "))
except ValueError:
    print("Ваше значение не является числом! Введите число от 1 до 12!")
    exit()

match n:
    case 1:
        print("Ваш месяц", m1)
    case 2:
        print("Ваш месяц", m2)
    case 3:
        print("Ваш месяц", m3)
    case 4:
        print("Ваш месяц", m4)
    case 5:
        print("Ваш месяц", m5)
    case 6:
        print("Ваш месяц", m6)
    case 7:
        print("Ваш месяц", m7)
    case 8:
        print("Ваш месяц", m8)
    case 9:
        print("Ваш месяц", m9)
    case 10:
        print("Ваш месяц", m10)
    case 11:
        print("Ваш месяц", m11)
    case 12:
        print("Ваш месяц", m12)
    case _:
        print("Неверный номер месяца!")
